{"latex": "Welcome to the \\textbf{USAYNO}, where each question has a yes/no answer. Choose any subset of the following six problems to answer. If you answer $n$ problems and get them \\textbf{all} correct, you will receive $\\max(0, (n-1)(n-2))$ points. If any of them are wrong (or you leave them all blank), you will receive $0$ points.\\\\\n\\\\\nYour answer should be a six-character string containing 'Y' (for yes), 'N' (for no), or 'B' (for blank). For instance if you think 1,2, and 6 are 'yes' and 3 and 4 are 'no', you should answer YYNNBY (and receive $12$ points if all five answers are correct, 0 points if any are wrong).\\\\\n\\\\\n(a) Can $1000$ queens be placed on a $2017\\times2017$ chessboard such that every square is attacked by some queen? A square is attacked by a queen if it lies on the same row, column, or diagonal as the queen.\\\\\n\\\\\n(b) A $2017\\times2017$ grid of squares originally contains a $0$ in each square. At any step, Kelvin the Frog choose two adjacent squares (two squares are adjacent if they share a side) and increments the numbers in both of them by $1$. Can Kelvin make every square contain a different power of $2$?\\\\\n\\\\\n(c) A \\textit{tournament} consists of single games between every pair of players, where each game has a winner and a loser with no ties. A set of people is \\textit{dominated} if there exists a player who beats all of them. Does there exist a tournament in which every set of $2017$ people is dominated?\\\\\n\\\\\n(d) Every cell of a $19\\times19$ grid is colored either red, yellow, green, or blue. Does there necessarily exist a rectangle whose sides are parallel to the grid, all of whose vertices are the same color?\\\\\n\\\\\n(e) Does there exist a $c\\in\\mathbb{R}^+$ such that $\\max(|A\\cdot A|, |A+A|)\\ge c|A|\\log^2|A|$ for all finite sets $A\\subset \\mathbb{Z}$?\\\\\n\\\\\n(f) Can the set $\\{1, 2, \\dots, 1093\\}$ be partitioned into $7$ subsets such that each subset is sum-free (i.e. no subset contains $a,b,c$ with $a+b=c$)?\\\\\n\\\\\n<span style=\"color:red\">The USAYNO disclaimer is only included in problem 33. I have included it here for convenience.", "url": "https://artofproblemsolving.com/community/c129h1387231p7718399", "category": ""}